spec/vcr/Spree_AvalaraTransaction/captured_orders/_cancel_order/should_receive_error.yml

---
http_interactions:
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R337472228","DocDate":"2017-01-10","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"AL","PostalCode":"36104","Country":"US"},{"AddressCode":"Dest","Line1":"A
        Different Road","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #162 - 51","TaxCode":"PC030000","ItemCode":"SKU-162","Qty":1,"Amount":10.0,"OriginCode":"Orig","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":false}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R337472228","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '798'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Tue, 10 Jan 2017 08:43:24 GMT
      Content-Length:
      - '581'
      Set-Cookie:
      - TS017f1821=01a8ddc44e1009df32d32c3aacd52c0f427935c2be67cccd2522a1691e48637e41ea7ac800315512be5c68e3dd40475afd262c31e9;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1NZ++unfvwf6Dvb29A/3iadbyF3s7uw+2d3a3d3fwxZtikTdttliFX73Z
        OXi0f+/R3v3x7sOHuwf39n6KG1dtVh4vqvWyRXOFgA+fFs3UfOw+PX2XL1Zt
        US3Dj99k77JJych4IOhTfLIz3vc/OsnK6bok1Gf+l9m758Uyb+ij7yVED/zx
        oqK/Ptrdfn6mLQwhXp7s3NuhRz/OJkVZtNf4pq3XOT59QpjPsvr6eX6Zl/ji
        p4rVfXzRx78/TkD0x/KKcMVfO+OdfeqVP6NG8pHBfmhUT/M2K0o7rhN0VTOu
        X71Gk1f5hWJz/Bx/f2ddF82b6xX3+LolgPZTM/ydXXxEsN8XTYbyIltws+Pn
        x0+OvzjG59TKfZq+fnP85jR9c/x7f/RLku8n+L80OZ7NamJKN0f6Af350XH6
        tDg/z+t82aavqmwGqPq1wfopMSU+PtGp+qJathfVIidi4NMuXV5WxMOlefne
        p7s7PIQuuQgv+eiM6b63c3/vwcOH+IYHa97f2d3d2b2/C6r8kmQU4v5w9376
        Ov1ONn3bVMv0NSOpX5vXv6yLC3z8c4+7mYyI6P+S5P8BjRYZV0gEAAA=
    http_version: 
  recorded_at: Tue, 10 Jan 2017 08:43:25 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R337472228","DocDate":"2017-01-10","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"AL","PostalCode":"36104","Country":"US"},{"AddressCode":"Dest","Line1":"A
        Different Road","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"},{"AddressCode":"2","Line1":"1600
        Pennsylvania Ave NW","Line2":null,"City":"Washington","PostalCode":"20500","Country":"US"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #162 - 51","TaxCode":"PC030000","ItemCode":"SKU-162","Qty":1,"Amount":10.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":false},{"LineNo":"1-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":5.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":false}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R337472228","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1145'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Tue, 10 Jan 2017 08:43:26 GMT
      Content-Length:
      - '672'
      Set-Cookie:
      - TS017f1821=01a8ddc44e3accf839bc7bab905f46707348bc067d1ab2a8e57eb9a00c17f6d5898bbf7a89fdedc0779c73f67422db1d30412cfb4b;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1fZq1/Onezu6D7Z3d7d0dfPGmWORNmy1W4Vdvdg4e7d97tPfp+MHe3qe7
        Dw9+ihtXbVYeL6r1skXz3fv2w6dFMzUfC1x8evouX6zaolqGH7/J3mWTkpHx
        QNCn+GRn/Kn/0UlWTtcloT7zv8zexUdDwzSDf3Xv3oN9Qn7vAF/QG8+LZd7Q
        N99LiFD440VFf320u/38TFuYV1+e7NzboUc/ziZFWbTX+Kat1zk+fUJjnWX1
        9fP8Mi/xxU8VKx5Jf8R9ygCijp4/eKVD2Rnv7FOv/Bk1ko/29a8uHcznT/M2
        K0o7rhN0VTOuX71Gk1f5hWJz/Bx/f2ddF82b6xX3+LolgPZTM/ydXXxEsN8X
        TYbyIltws+Pnx0+OvzjG59TKfZq+fnP85jR9c/x7f/RLku8nvyQZEdr+dDx7
        pe8YfJ69ot7o0Y9/9qaDX9k4zD39qzsb5vMfxmzcEksG4sh+y8n4fiJNjmez
        mlSHExj9gP786Dh9Wpyf53W+bNNXVTYDVP3aIP2UdAo+PtGJ+qJathfVIida
        4NMuWV5WpIJK8/K9T3d3mJ+61CK85KMzJvvezv29Bw8f4hserHl/Z3d3Z/f+
        Lqgi3KXI4bvdT3d20pf5ctlcl5fZssjS48s8ffFdANFmBgxT0Qzgu1kzL5YX
        LaGDTzcPgBCjvuljwRYfPT3B350BcJsAdcJcH0Id8/H/AOExcvTUBQAA
    http_version: 
  recorded_at: Tue, 10 Jan 2017 08:43:26 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R337472228","DocDate":"2017-01-10","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"AL","PostalCode":"36104","Country":"US"},{"AddressCode":"Dest","Line1":"A
        Different Road","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"},{"AddressCode":"2","Line1":"1600
        Pennsylvania Ave NW","Line2":null,"City":"Washington","PostalCode":"20500","Country":"US"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #162 - 51","TaxCode":"PC030000","ItemCode":"SKU-162","Qty":1,"Amount":10.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":false},{"LineNo":"1-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":5.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":false}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R337472228","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1145'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Tue, 10 Jan 2017 08:43:27 GMT
      Content-Length:
      - '673'
      Set-Cookie:
      - TS017f1821=01a8ddc44eceb2475688cf83d3bc8b709b78855c869bd6a8755529c693b7874316dbf0d5439f0863fc90c7e736c060e6ea5286e67a;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1NZ++unfvwf6Dvb29A/3iadbyF3s7uw+2d3a3d3fwxZtikTdttliFX73Z
        OXi0f+/R3sF492B3b//ew5/ixlWblceLar1s0Xz3vv3wadFMzccCF5+evssX
        q7aoluHHb7J32aRkZDwQ9Ck+2Rl/6n90kpXTdUmoz/wvs3fPi2Xe0EffS4ge
        +ONFRX99tLv9/ExbGEK8PNm5t0OPfpxNirJor/FNW69zfPqEMJ9l9fXz/DIv
        8cVPFSvGq49/f5yAqGPhD14RrvhrZ7yzT73yZ9RIPtrXv7qjMp8/zdusKO24
        TtBVzbh+9RpNXuUXis3xc/z9nXVdNG+uV9zj65YA2k/N8Hd28RHBfl80GcqL
        bMHNjp8fPzn+4hifUyv3afr6zfGb0/TN8e/90S9Jvp/8kmREaPvT8eyVvmPw
        efaKeqNHP/7Zmw5+ZeMw9/Sv7myYz38Ys3FLLBmII/stJ+P7iTQ5ns1q0hBO
        YPQD+vOj4/RpcX6e1/myTV9V2QxQ9WuD9FPSEPj4RCfqi2rZXlSLnGiBT7tk
        eVmRQinNy/c+3d1hfupSi/CSj86Y7Hs79/cePHyIb3iw5v2d3d2d3fu7oIpw
        lyKH73Y/3dlJX+bLZXNdXmbLIkuPL/P0xXcBRJsZMExFM4DvZs28WF60hA4+
        3TwAQoz6po8FW3z09AR/dwbAbQLUCXN9CHUzFxE1/EuS/wdedxAj1AUAAA==
    http_version: 
  recorded_at: Tue, 10 Jan 2017 08:43:28 GMT
recorded_with: VCR 3.0.3
