spec/vcr/Spree_AvalaraTransaction/captured_orders/_commit_avatax_final/should_commit_avatax_final.yml

---
http_interactions:
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R414060146","DocDate":"2017-03-14","Discount":"0.0","Commit":true,"DocType":"SalesInvoice","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"AL","PostalCode":"36104","Country":"US"},{"AddressCode":"Dest","Line1":"A
        Different Road","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"},{"AddressCode":"2","Line1":"1600
        Pennsylvania Ave NW","Line2":null,"City":"Washington","PostalCode":"20500","Country":"US"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #1 - 8720","TaxCode":"PC030000","ItemCode":"SKU-1","Qty":1,"Amount":10.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":false},{"LineNo":"1-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":5.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":false}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R414060146","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1144'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Tue, 14 Mar 2017 19:35:11 GMT
      Content-Length:
      - '668'
      Set-Cookie:
      - TS017f1821=01a8ddc44e94ab0692d53fe85d0568da22fc66393edceda6ce773e39559cc576f6af824762a24c354abf9ff9d91a88e9bd259832c1;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1NZ++2t/d3/l0Z3f/U/3iadbyF3s7uw+2d+5t7+7jizfFIm/abLEKv3qz
        +/DRvfuPdnfH9+9xs6rNyuNFtV62aLh73374tGim5uMd++npu3yxaotqGX78
        JnuXTUpGwwNBn+KTnTGjaj46ycrpuiSkZ/6X2bvnxTJv6KPvJUQJ/PGior8+
        2t1+fqYtDAlenuzc26FHP84mRVm01/imrdc5Pn1CmM+y+vp5fpmX+OKnihXj
        1ce/P05A1LHwB68IV/y1M97Zp175M2okHwmxCbfOqMznT/M2K0o7rhN0VTOu
        X71Gk1f5hWJz/Bx/f2ddF82b6xX3+LolgPZTM/ydXXxEsN8XTYbyIltws+Pn
        x0+OvzjG59TKfZq+fnP85jR9c/x7f/RLku8nvyQZEdr+dDx7pe8YfJ69ot7o
        0Y9/9qaDX9k4zD39qzsb5vMfxmzcEksG4sh+y8n4fiJNjmezmnSDExj9gP78
        6Dh9Wpyf53W+bNNXVTYDVP3aIP2UdAM+PtGJ+qJathfVIida4NMuWV5WpEpK
        8/K9T3d3mJ+61CK85KMzJvvezv29Bw8f4hserHl/Z3d3Z/f+Lqgi3KXI4bvd
        T3d20pf5ctlcl5fZssjS48s8ffFdANFmBgxT0Qzgu1kzL5YXLaGDTzcPgBCj
        vuljwRYfPT3B350BcJsAdcJcH0LdzEVEAf+S5P8Bhrm1484FAAA=
    http_version: 
  recorded_at: Tue, 14 Mar 2017 19:35:13 GMT
recorded_with: VCR 3.0.3
