spec/vcr/Spree_AvalaraTransaction/captured_orders/_commit_avatax_final/with_CustomerUsageType/does_not_add_additional_tax.yml

---
http_interactions:
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R652235081","DocDate":"2017-03-14","Discount":"0.0","Commit":false,"DocType":"SalesInvoice","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"AL","PostalCode":"36104","Country":"US"},{"AddressCode":"Dest","Line1":"A
        Different Road","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"},{"AddressCode":"2","Line1":"1600
        Pennsylvania Ave NW","Line2":null,"City":"Washington","PostalCode":"20500","Country":"US"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #12 - 6497","TaxCode":"PC030000","ItemCode":"SKU-12","Qty":1,"Amount":10.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":"A","Discounted":false,"TaxIncluded":false},{"LineNo":"1-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":5.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":"A","Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":false}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":"A","ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R652235081","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1144'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Tue, 14 Mar 2017 18:33:42 GMT
      Content-Length:
      - '643'
      Set-Cookie:
      - TS017f1821=01a8ddc44ec184d10770e45da4e0d35306fc8ec494eab24c2f7fd90bcde9f417bb869095ad9e32939c9205b6b029e870428bc627ae;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1NZ+++vT+3t69+zsHu/rF06zlL/Z2dh9s79zb3t3HF2+KRd602WIVfvVm
        9+DRvXuP9vfGD+5zs6rNyuNFtV62aLjrPnxaNFPz8Y799PRdvli1RbXEx17r
        N9m7bFIyHq4xfdj74CQrp+uSUJ65r7J3z4tl3tAH30uICvjjRUV/fbS7/fxM
        W5jhvzzZubdDj36cTYqyaK/xTVuvc3z6hLCeZfX18/wyL/HFTxUrRjTEnSH0
        BwmQ3jheEab8x3hnn3rlz6gNf6S/x0f0NG+zorRjOkEvNeP51Ws0eZVfKCbH
        z/H3d9Z10by5XnFvr1sCZz81Q9/hGSfY74Uhg3iRLbjR8fPjJ8dfHONzauM+
        TV+/OX5zmr45/r0/+iXJ95NfkowIZ38enr3Sdwwyz15RX/Tox197HviTH02D
        fNqbhu8n0uR4NqtJFTgZ0Q/oz4+O06fF+Xle58s2fVVlM0DVrw3KT0kV4OMT
        naIvqmV7US1yogQ+7RLlZUWaozQv3/t0d4dVSpdWhJd8dMYk39u5v/fg4UN8
        w4M17+/s7u7s3t8FTYSvFDl8t/vpzk76Ml8um+vyMlsWWXp8macvvgsg2syA
        2cNnZgDfzZp5sbxoCR18unkAhBj1TR8Ltvjo6Qn+7gyA2wSoE+b6EOpmLiL6
        9pck/w8dSprdvQUAAA==
    http_version: 
  recorded_at: Tue, 14 Mar 2017 18:33:44 GMT
recorded_with: VCR 3.0.3
