spec/vcr/Spree_AvalaraTransaction/return_orders/_commit_avatax_final/should_commit_avatax_final.yml

---
http_interactions:
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R537030190","DocDate":"2017-03-14","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"AL","PostalCode":"36104","Country":"US"},{"AddressCode":"Dest","Line1":"A
        Different Road","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #15 - 7010","TaxCode":"PC030000","ItemCode":"SKU-15","Qty":1,"Amount":10.0,"OriginCode":"Orig","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":false}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R537030190","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '798'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Tue, 14 Mar 2017 19:31:04 GMT
      Content-Length:
      - '580'
      Set-Cookie:
      - TS017f1821=01a8ddc44e8505c615c5d082c358637faa884a9a5830b58c8ee803f393b13b7d6da29155d506dd44d3d1c56b95d8ff877ca9a3ac65;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1fZq1/Onezu6D7Z1727v7+OJNscibNluswq/e7D58dG/30c7++ODB/Z2H
        +wc/xY2rNiuPF9V62aL57o798GnRTM3H7tPTd/li1RbVMvz4TfYum5SMjAeC
        PsUnO2PBSz86ycrpuiTUZ/6X2bv4aGiYZvCv7t97sHNvZ/eh9JC9e14s84a+
        +V5ChMIfLyr666Pd7edn2sK8+vKEXqRHP84mRVm01/imrdc5Pn1CY51l9fXz
        /DIv8cVPFav7+KI/4j5lANEf/Ssdys54Z5965c+okXzEw6K/BumQt1lR2nGd
        oKuacf3qNZq8yi8Um+Pn+Ps767po3lyvuMfXLQG0n5rh7+ziI4L9vmgylBfZ
        gpsdPz9+cvzFMT6nVu7T9PWb4zen6Zvj3/ujX5J8P8H/pcnxbFYTt7o50g/o
        z4+O06fF+Xle58s2fVVlM0DVrw3WT4mN8fGJTtUX1bK9qBY5EQOfdunysiKu
        L83L9z7d3eEhdMlFeMlHZ0z3vZ37ew8ePsQ3PFjz/s7u7s7u/V1Q5ZckoxD3
        h7v309fpd7Lp26Zapq8ZSf3avP5lXVzg45973DEh/w/0g/xYSAQAAA==
    http_version: 
  recorded_at: Tue, 14 Mar 2017 19:31:06 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R537030190","DocDate":"2017-03-14","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"AL","PostalCode":"36104","Country":"US"},{"AddressCode":"Dest","Line1":"A
        Different Road","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"},{"AddressCode":"2","Line1":"1600
        Pennsylvania Ave NW","Line2":null,"City":"Washington","PostalCode":"20500","Country":"US"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #15 - 7010","TaxCode":"PC030000","ItemCode":"SKU-15","Qty":1,"Amount":10.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":false},{"LineNo":"1-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":5.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":false}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R537030190","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1145'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Tue, 14 Mar 2017 19:31:04 GMT
      Content-Length:
      - '675'
      Set-Cookie:
      - TS017f1821=01a8ddc44e6bd07fe94be7bebeb44390659070883086c5333f37f2d99ad196e0a387340cc0659b8f15705f770cf705dd7f6cc14d75;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1NZ++un/vwc69nd2HO/rF06zlL/Z2dh9s79zb3t3HF2+KRd602WIVfvVm
        9+Gje7uPdu6P9x8c7D24/+lPceOqzcrjRbVetmi+e99++LRopuZj7pA/PX2X
        L1ZtUS3Dj99k77JJych4IOhTfLIz/tT/6CQrp+uSUJ/5X2bvnhfLvKGPvpcQ
        PfDHi4r++mh3+/mZtjCEeHlCZKBHP84mRVm01/imrdc5Pn1CmM+y+vp5fpmX
        +OKnihXj1ce/P05A1LHwB68IV/y1M97Zp175M2okHwnJCbfOqMznT/M2K0o7
        rhN0VTOuX71Gk1f5hWJz/Bx/f2ddF82b6xX3+LolgPZTM/ydXXxEsN8XTYby
        Iltws+Pnx0+OvzjG59TKfZq+fnP85jR9c/x7f/RLku8nvyQZEdr+dDx7pe8Y
        fJ69ot7o0Y9/9qaDX9k4zD39qzsb5vMfxmzcEksG4sh+y8n4fiJNjmezmjSE
        Exj9gP786Dh9Wpyf53W+bNNXVTYDVP3aIP2UNAQ+PtGJ+qJathfVIida4NMu
        WV5WpFBK8/K9T3d3mJ8IDyHYGZN5b+f+3oOHD/END86039nd3dm9v6tUkDfw
        OZFYuEuRw2e7n+7spC/z5bK5Li+zZZGlx5d5+uK7eFObGbBMRTOA72bNvFhe
        tAQZn24eACEquHQGwJ8FqBPm+uAraYvPn54Q6mYuImr4lyT/D96NN0vUBQAA
    http_version: 
  recorded_at: Tue, 14 Mar 2017 19:31:07 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R537030190","DocDate":"2017-03-14","Discount":"0.0","Commit":true,"DocType":"SalesInvoice","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"AL","PostalCode":"36104","Country":"US"},{"AddressCode":"Dest","Line1":"A
        Different Road","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"},{"AddressCode":"2","Line1":"1600
        Pennsylvania Ave NW","Line2":null,"City":"Washington","PostalCode":"20500","Country":"US"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #15 - 7010","TaxCode":"PC030000","ItemCode":"SKU-15","Qty":1,"Amount":10.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":false},{"LineNo":"1-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":5.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":false}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R537030190","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1146'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Tue, 14 Mar 2017 19:31:05 GMT
      Content-Length:
      - '668'
      Set-Cookie:
      - TS017f1821=01a8ddc44e9601f481539bc08d9448c909d1dc5227fa684f6f15e916e7ecd62988d6529a382ad41d6b1c3ebb2220160a30956a7794;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1NZ++un/vwc69nd2HO/rF06zlL/Z2dh9s79zb3t3HF2+KRd602WIVfvVm
        9+Gje7uPdj4d7+zf43ZVm5XHi2q9bNFy97798GnRTM3H3Bd/evouX6zaolqG
        H7/J3mWTkvHwQNCn+GRn/Kn/0UlWTtclYT3zv8zePS+WeUMffS8hUuCPFxX9
        9dHu9vMzbWFo8PKEKECPfpxNirJor/FNW69zfPqEMJ9l9fXz/DIv8cVPFSvG
        q49/f5yAqGPhD14Rrvhrh4hGvfJn1Eg+EmoTbp1Rmc+f5m1WlHZcJ+iqZly/
        eo0mr/ILxeb4Of7+zroumjfXK+7xdUsA7adm+Du7+Ihgvy+aDOVFtuBmx8+P
        nxx/cYzPqZX7NH395vjNafrm+Pf+6Jck309+STIitP3pePZK3zH4PHtFvdGj
        H//sTQe/snGYe/pXdzbM5z+M2bgllgzEkf2Wk/H9RJocz2Y1KQcnMPoB/fnR
        cfq0OD/P63zZpq+qbAao+rVB+ikpB3x8ohP1RbVsL6pFTrTAp12yvKxIl5Tm
        5Xuf7u4wPxEeQrAzJvPezv29Bw8f4hsenGm/s7u7s3t/V6kgb+BzIrFwlyKH
        z3Y/3dlJX+bLZXNdXmbLIkuPL/P0xXfxpjYzYJmKZgDfzZp5sbxoCTI+3TwA
        QlRw6QyAPwtQJ8z1wVfSFp8/PSHUzVxENPAvSf4fmm8bRc8FAAA=
    http_version: 
  recorded_at: Tue, 14 Mar 2017 19:31:08 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R537030190.","DocDate":"2017-03-14","Commit":true,"DocType":"ReturnOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"AL","PostalCode":"36104","Country":"US"},{"AddressCode":"Dest","Line1":"A
        Different Road","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"},{"AddressCode":"2","Line1":"1600
        Pennsylvania Ave NW","Line2":null,"City":"Washington","PostalCode":"20500","Country":"US"}],"Lines":[{"LineNo":"-RA","ItemCode":"fake-refund-transaction-2","Qty":1,"Amount":-15.0,"OriginCode":"Orig","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Refund","TaxIncluded":true}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R537030190","DetailLevel":"Tax","CurrencyCode":"USD","TaxOverride":{"TaxOverrideType":"TaxDate","Reason":"Refund
        for return #2","TaxDate":"2017-03-14"}}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '971'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Tue, 14 Mar 2017 19:31:06 GMT
      Content-Length:
      - '581'
      Set-Cookie:
      - TS017f1821=01a8ddc44e8b5d822e206086cb06deedbc8eaeeacf88c69c809fa496b52067b321f1c2920340795092605b92db6eeb4c24266c87b2;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1NZ++un/vwc69nd2HO2P95mnW8jd7O7sPtnfube/u44s3xSJv2myxCr96
        s/vw0b3dRzufjvc/vb//YG/vp7hx1Wbl8aJaL1s0p3bj/T37xdOimZqvduyn
        p+/yxaotqmX48ZvsXTYpGaEOGPqGP90Z3z/wPzzJyum6pEHMwq+zd8+LZd7Q
        h99LiDj440VFf320/epYGxiivNyRRz/OJkVZtNf4pq3XOT59QgOYZfX18/wy
        L/HFTxWr+/iiP4z+cAGxO6RXhDA+2Rnv7FPPpiE+8ocwPLineZsVpR3eCbqs
        GeevXqPJq/xCsTp+jr+/s66L5s31int93RJI+6khw84uPiLYXw9dhvUiW3DD
        4+fHT46/MIR2n6av3xy/OU3fHP/eH/2S5PsJ/i9NjmezmtjVTZh+QH9+dJw+
        Lc7P8zpftumrKpsBqn5tcH9K3IqPT3TivqiW7UW1yIkk+LRLnZcVMXdpXr73
        6e4Oc32XaISXfHTG9N/bub/34OFDfMODNe/v7O7u7N7fBV1+STIKcX+4ez99
        nX4nm75tqmX6mpHUr83rX9bFBT7+ucfdTEZEJ/yS5P8BKbnGMmIEAAA=
    http_version: 
  recorded_at: Tue, 14 Mar 2017 19:31:08 GMT
recorded_with: VCR 3.0.3
