spec/vcr/Spree_AvalaraTransaction/return_orders/_commit_avatax_final/should_receive_post_order_to_avalara.yml

---
http_interactions:
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R075356537","DocDate":"2017-03-14","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"AL","PostalCode":"36104","Country":"US"},{"AddressCode":"Dest","Line1":"A
        Different Road","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #16 - 5635","TaxCode":"PC030000","ItemCode":"SKU-16","Qty":1,"Amount":10.0,"OriginCode":"Orig","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":false}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R075356537","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '798'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Tue, 14 Mar 2017 19:31:06 GMT
      Content-Length:
      - '581'
      Set-Cookie:
      - TS017f1821=01a8ddc44e46f5a717ede8b803e2602aa26972d8bef9ec500efd19d3b653d6e714b61d9c057181323bb8e6a3030650ee8f66a4c559;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1NZ++2nlw/979T+/fe6BfPM1a/mJvZ/fB9s697d19fPGmWORNmy1W4Vdv
        dh8+urf7aOfBeG93/yFB+iluXLVZebyo1ssWzXd37IdPi2ZqPnafnr7LF6u2
        qJbhx2+yd9mkZGQ8EPQpPtkZC1760UlWTtcloT7zv8zePS+WeUMffS8heuCP
        FxX99dHu9vMzbWEI8fJk594OPfpxNinKor3GN229zvHpE8J8ltXXz/PLvMQX
        P1Ws7uOLPv79cQKiP5ZXhCv+2hnv7FOv/Bk1ko8M9kOjepq3WVHacZ2gq5px
        /eo1mrzKLxSb4+f4+zvrumjeXK+4x9ctAbSfmuHv7OIjgv2+aDKUF9mCmx0/
        P35y/MUxPqdW7tP09ZvjN6fpm+Pf+6Nfknw/wf+lyfFsVhNTujnSD+jPj47T
        p8X5eV7nyzZ9VWUzQNWvDdZPiSnx8YlO1RfVsr2oFjkRA5926fKyIh4uzcv3
        Pt3d4SF0yUV4yUdnTPe9nft7Dx4+xDc8WPP+zu7uzu79XVDllySjEPeHu/fT
        1+l3sunbplqmrxlJ/dq8/mVdXODjn3vczWRERP+XJP8P/E8BwUgEAAA=
    http_version:
  recorded_at: Tue, 14 Mar 2017 19:31:09 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R075356537","DocDate":"2017-03-14","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"AL","PostalCode":"36104","Country":"US"},{"AddressCode":"Dest","Line1":"A
        Different Road","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"},{"AddressCode":"2","Line1":"1600
        Pennsylvania Ave NW","Line2":null,"City":"Washington","PostalCode":"20500","Country":"US"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #16 - 5635","TaxCode":"PC030000","ItemCode":"SKU-16","Qty":1,"Amount":10.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":false},{"LineNo":"1-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":5.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":false}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R075356537","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1145'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Tue, 14 Mar 2017 19:31:07 GMT
      Content-Length:
      - '675'
      Set-Cookie:
      - TS017f1821=01a8ddc44e529ef20c37d4610b5538506c99b4e89c50bdf214d59bd09e69be4186ee3778301a5ea003997665f076a8dea2ea72f51a;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1NZ++2nlw/979T+/fe6BfPM1a/mJvZ/fB9s697d19fPGmWORNmy1W4Vdv
        dh8+urf7aOfB+MHDe5/uPHjwU9y4arPyeFGtly2a7963Hz4tmqn5eMd+evou
        X6zaolqGH7/J3mWTkpHxQNCn+GRn/Kn/0UlWTtcloT7zv8zePS+WeUMffS8h
        euCPFxX99dHu9vMzbWEI8fJk594OPfpxNinKor3GN229zvHpE8J8ltXXz/PL
        vMQXP1WsGK8+/v1xAqKOhT94Rbjir53xzj71yp9RI/lISE64dUZlPn+at1lR
        2nGdoKuacf3qNZq8yi8Um+Pn+Ps767po3lyvuMfXLQG0n5rh7+ziI4L9vmgy
        lBfZgpsdPz9+cvzFMT6nVu7T9PWb4zen6Zvj3/ujX5J8P/klyYjQ9qfj2St9
        x+Dz7BX1Ro9+/LM3HfzKxmHu6V/d2TCf/zBm45ZYMhBH9ltOxvcTaXI8m9Wk
        IZzA6Af050fH6dPi/Dyv82WbvqqyGaDq1wbpp6Qh8PGJTtQX1bK9qBY50QKf
        dsnysiKFUpqX7326u8P81KUW4SUfnTHZ93bu7z14+BDf8GDN+zu7uzu793dB
        FeEuRQ7f7X66s5O+zJfL5rq8zJZFlh5f5umL7wKINjNgmIpmAN/NmnmxvGgJ
        HXy6eQCEGPVNHwu2+OjpCf7uDIDbBKgT5voQ6mYuImr4lyT/DyZiJrjUBQAA
    http_version:
  recorded_at: Tue, 14 Mar 2017 19:31:09 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R075356537","DocDate":"2017-03-14","Discount":"0.0","Commit":true,"DocType":"SalesInvoice","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"AL","PostalCode":"36104","Country":"US"},{"AddressCode":"Dest","Line1":"A
        Different Road","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"},{"AddressCode":"2","Line1":"1600
        Pennsylvania Ave NW","Line2":null,"City":"Washington","PostalCode":"20500","Country":"US"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #16 - 5635","TaxCode":"PC030000","ItemCode":"SKU-16","Qty":1,"Amount":10.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":false},{"LineNo":"1-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":5.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":false}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R075356537","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1146'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Tue, 14 Mar 2017 19:31:07 GMT
      Content-Length:
      - '670'
      Set-Cookie:
      - TS017f1821=01a8ddc44e7c5c164c39e028a16740daea477727d21003a1f8bb947c0650de54356e680bd5f8efd486f9a68e1de26cbddd37cc9f95;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1NZ++2nlw/979T+/fe6BfPM1a/mJvZ/fB9s697d19fPGmWORNmy1W4Vdv
        dh8+urf7aOdgfO9Tbla1WXm8qNbLFg1379sPnxbN1Hy8Yz89fZcvVm1RLcOP
        32TvsknJaHgg6FN8sjN2XdFHJ1k5XZeE9Mz/Mnv3vFjmDX30vYQogT9eVPTX
        R7vbz8+0hSHBy5Odezv06MfZpCiL9hrftPU6x6dPCPNZVl8/zy/zEl/8VLFi
        vPr498cJiDoW/uAV4Yq/dsY7+9Qrf0aN5CMhNuHWGZX5/GneZkVpx3WCrmrG
        9avXaPIqv1Bsjp/j7++s66J5c73iHl+3BNB+aoa/s4uPCPb7oslQXmQLbnb8
        /PjJ8RfH+JxauU/T12+O35ymb45/749+SfL95JckI0Lbn45nr/Qdg8+zV9Qb
        Pfrxz9508Csbh7mnf3Vnw3z+w5iNW2LJQBzZbzkZ30+kyfFsVpNucAKjH9Cf
        Hx2nT4vz87zOl236qspmgKpfG6Sfkm7Axyc6UV9Uy/aiWuREC3zaJcvLilRJ
        aV6+9+nuDvMT4SEEO2My7+3c33vw8CG+4cGZ9ju7uzu793eVCvIGPicSC3cp
        cvhs99OdnfRlvlw21+Vltiyy9PgyT198F29qMwOWqWgG8N2smRfLi5Yg49PN
        AyBEBZfOAPizAHXCXB98JW3x+dMTQt3MRUQB/5Lk/wEYjVHvzgUAAA==
    http_version:
  recorded_at: Tue, 14 Mar 2017 19:31:10 GMT
recorded_with: VCR 3.0.3
